In [8]:
class MyList():
    data = []

    def append(self, a):
        self.data.append(a)

    def pop(self):
        self.data.pop()

In [9]:
list_a = MyList()

list_a.append(13)
list_a.append(4)
list_a.append(5)
list_a.pop()
print(list_a.data)

[13, 4]

In [10]:
class Circle():
    pi = 3.14

    def __init__(self, r, x=0, y=0):
        self.r = r
        self.x = x
        self.y = y

    def area(self):
        return self.pi * self.r ** 2

    def center(self):
        return (self.x, self.y)

    def move(self, x, y):
        self.x = x
        self.y = y 
        print(f'원의 중심이 {x}, {y}로 이동했습니다.')

    def round(self):
        return self.r * self.pi * 2

In [14]:
c1 = Circle(5)
c2 = Circle(13, 2, 1)

In [15]:
print(c1.area(), c2.area())

78.5 530.66

In [19]:
import pandas as pd

In [20]:
info = {
    '고객명': ['박세리', '이대호', '손흥민', '김연아', '마이클조던'],
    '생년월일': ['1980-01-02', '1982-02-22', '1993-06-12', '1988-10-16', '1970-03-03'],
    '성별': ['여자', '남자', '남자', '여자', '남자']
}

In [21]:
money = {
     '고객명': ['김연아', '박세리', '손흥민', '이대호', '타이거우즈'],
    '연봉': ['2000원', '3000원', '1500원', '2500원', '3500원']
}

In [22]:
info_df = pd.DataFrame(info)
money_df = pd.DataFrame(money)

In [23]:
pd.merge(info_df, money_df)

   고객명        생년월일  성별     연봉
0  박세리  1980-01-02  여자  3000원
1  이대호  1982-02-22  남자  2500원
2  손흥민  1993-06-12  남자  1500원
3  김연아  1988-10-16  여자  2000원

- 같은 컬럼명을 중심으로 중복된 데이터 합쳐줌 (how='inner' -> 기본값)
- 같은 컬럼명을 중심으로 모든 데이터 합치기(how='outer')

In [24]:
pd.merge(info_df, money_df, how='outer')

     고객명        생년월일   성별     연봉
0    김연아  1988-10-16   여자  2000원
1  마이클조던  1970-03-03   남자    NaN
2    박세리  1980-01-02   여자  3000원
3    손흥민  1993-06-12   남자  1500원
4    이대호  1982-02-22   남자  2500원
5  타이거우즈         NaN  NaN  3500원

In [25]:
pd.merge(info_df, money_df, how='left')

     고객명        생년월일  성별     연봉
0    박세리  1980-01-02  여자  3000원
1    이대호  1982-02-22  남자  2500원
2    손흥민  1993-06-12  남자  1500원
3    김연아  1988-10-16  여자  2000원
4  마이클조던  1970-03-03  남자    NaN

In [26]:
pd.merge(info_df, money_df, how='right')

     고객명        생년월일   성별     연봉
0    김연아  1988-10-16   여자  2000원
1    박세리  1980-01-02   여자  3000원
2    손흥민  1993-06-12   남자  1500원
3    이대호  1982-02-22   남자  2500원
4  타이거우즈         NaN  NaN  3500원

In [27]:
pd.merge(money_df, info_df, how='left')

     고객명     연봉        생년월일   성별
0    김연아  2000원  1988-10-16   여자
1    박세리  3000원  1980-01-02   여자
2    손흥민  1500원  1993-06-12   남자
3    이대호  2500원  1982-02-22   남자
4  타이거우즈  3500원         NaN  NaN

In [28]:
pd.merge(money_df, info_df, how='right')

     고객명     연봉        생년월일  성별
0    박세리  3000원  1980-01-02  여자
1    이대호  2500원  1982-02-22  남자
2    손흥민  1500원  1993-06-12  남자
3    김연아  2000원  1988-10-16  여자
4  마이클조던    NaN  1970-03-03  남자

In [29]:
info ={
    'name': 'hong',
    'location': 'seoul',
    'age': 20,
    'models': ['iphone', 'mac book', 'watch'],
    'phone_book': {
        'kim': '010-1234-1234',
        'lee': '010-4567-4567',
    } 
}

In [30]:
print(info['name'])

hong

In [32]:
print(info['models'][0])

iphone

In [33]:
print(info['phone_book']['kim'])

010-1234-1234